#--coding:utf-8--

'''
有趣的色子，四个六面的色子：
A:(2, 2, 2, 2, 5, 6)
B:(1, 1, 4, 4, 4, 4)
C:(3, 3, 3, 3, 3, 3)
D:(1, 2 ,3, 4, 5, 6)
两人从四个色子中任选一个，抛一次，数目大的获胜。
求选哪个色子胜利的概率大
'''
import random
A = (2, 2, 2, 2, 5, 6)
B = (1, 1, 4, 4, 4, 4)
C = (3, 3, 3, 3, 3, 3)
#D = (1, 2, 3, 4, 5, 6)

Test_round = 1024000
def vs(x, y):
	xn, yn = 0, 0
	for i in xrange(Test_round):
		a = random.choice(x)
		b = random.choice(y)
		if a > b:
			xn += 1
		elif a < b:
			yn += 1
	print xn, yn,
	return xn > yn 
if __name__ == '__main__':
	print 'A vs B:', vs(A, B)	
	print 'A vs C:', vs(A, C)
	print 'B vs C:', vs(B, C)
'''
结果：
A vs B: 569376 454624 True
A vs C: 341840 682160 False
B vs C: 683114 340886 True
很明显，这道题是条件概率问题：
P(A > B) = P{A > B | B = 1}*P{B=1} + P{A > B | B = 4}*P{B=4}
	= 1 ×  1/3 + 1/3 × 2/3 = 5/9
	P(A = B) = 0
	P(A < B) = 4/9
P(A > C) = P{A > C | C = 3}*P(C = 3)
	=1/3 * 1 = 1/ 3
	P(A = C ) = 0
	P(A < C ) = 2/3
P(B > C) = P(B > C | C = 3) * P(C = 3)
	=2/3 * 1 = 2/3
	P(B = C ) = 0
	P(B < C ) = 1/ 3

所以这道题属于策略问题，Ａ > B, B > C, C > A
先选的死的惨。
另外如果加上Ｄ为正常色子的话，可以比较一下
Ｐ(D > A ) = P{D > A | A = 2} * P(A = 2) + P{D > A | A = 5} * P(A = 5) 
		+ P{D > A | A = 6} * P(A = 6)
	=2/3 * 2 / 3 + 1/6 * 1/6 + 0 = 4/9 + 1/36=17/36
	P(D = A) = P{D = A | A = 2} * P(A = 2) + P{D = A | A = 5} * P(A = 5)
		+ P{D = A | A = 6} * P(A = 6)
		=1/6 * 2/3 + 1/6 * 1/6 + 1/6 *1/6 = 1/9 + 1/18 = 1/6
	P(D < A) = 1 - P(D > A) - P(D = A) = 1- 17/36 - 1/6 = 13/36
P(D > B) = P{D > B | B = 1} * P(B = 1) + P{D > B | B = 4} * P(B = 4)
	= 5/6 * 1/3 + 1/3 * 2/ 3 = 5/18 + 2/9=1/2
	P(D = B) = P{D = B | B = 1} * P(B = 1) + P{D =B | B = 4} * P(B = 4)
		= 1/ 6 * 1/ 3 + 1/ 6 * 2/3 = 1/6
	P(D < B) = 1/3
P(D > C) = P{D > C | C = 3} * P(C = 3)
	= 1/2 * 1 = 1/2
	P(D = C) = P{D = C | C = 3} * P(C = 3)
		= 1/6 * 1 = 1/6
	P(D < C) = 1/3
所以还是正常的色子获胜的概率大一些。
'''
